{
  "peft_type": "LORA",
  "auto_mapping": {
    "base_model_class": "DistilBertModel",
    "parent_library": "transformers.models.distilbert.modeling_distilbert"
  },
  "base_model_name_or_path": "sentence-transformers/clip-ViT-B-32-multilingual-v1",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "r": 16,
  "rank_pattern": {},
  "alpha_pattern": {},
  "target_modules": ["q_lin", "v_lin", "k_lin", "out_lin"],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}